## Staging: cognito
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 3 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
        id                         = "ca-central-1_Cguq9JNQ1"
        name                       = "forms_user_pool"
        tags                       = {}
        # (12 unchanged attributes hidden)

      ~ lambda_config {
          + create_auth_challenge          = (known after apply)
          + define_auth_challenge          = (known after apply)
          + verify_auth_challenge_response = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.forms will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "forms" {
      ~ explicit_auth_flows                  = [
          + "ALLOW_CUSTOM_AUTH",
            # (2 unchanged elements hidden)
        ]
        id                                   = "17bsg3b2b7q5snon007rru264u"
        name                                 = "forms_client"
        # (14 unchanged attributes hidden)
    }

  # aws_lambda_function.cognito_email_sender will be updated in-place
  ~ resource "aws_lambda_function" "cognito_email_sender" {
        id                             = "Cognito_Email_Sender"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:6",
        ] -> (known after apply)
      ~ runtime                        = "nodejs14.x" -> "nodejs16.x"
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.create_auth_challenge will be created
  + resource "aws_lambda_function" "create_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/create_auth_challenge_main.zip"
      + function_name                  = "Cognito_Create_Auth_Challenge"
      + handler                        = "create_auth_challenge.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_cognito_lambda"
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "a558FolyXFqP70dWtM31xNeYm00LTl59ifhV76rJkcU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.define_auth_challenge will be created
  + resource "aws_lambda_function" "define_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/define_auth_challenge_main.zip"
      + function_name                  = "Cognito_Define_Auth_Challenge"
      + handler                        = "define_auth_challenge.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_cognito_lambda"
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "Cc3ASDoIutzXXiH+tnoUGVQ8DNB7U43INl4bssgjglA="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.verify_auth_challenge will be created
  + resource "aws_lambda_function" "verify_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/verify_auth_challenge_main.zip"
      + function_name                  = "Cognito_Verify_Auth_Challenge"
      + handler                        = "verify_auth_challenge.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_cognito_lambda"
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "YTrYt2Gc41F780tGoHTV6HXFRfCx1H6qRARMA5kdi8w="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_layer_version.cognito_email_sender_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "cognito_email_sender_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ compatible_runtimes         = [ # forces replacement
          - "nodejs12.x",
          - "nodejs14.x",
          + "nodejs16.x",
        ]
      ~ created_date                = "2023-04-25T19:05:39.105+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_size            = 14101894 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.create_auth_challenge_nodejs will be created
  + resource "aws_lambda_layer_version" "create_auth_challenge_nodejs" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs16.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/verify_create_auth_challenge_nodejs.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "create_auth_challenge_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "h81uo848zuFF292ja3VaG9u1S1c6dZWL2cJgURojjKU="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

Plan: 5 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
